{
  "landingPage": {
    "title": "👋 I'm Adrian Pike",
    "bio": "I am a Full Stack Developer with expertise in building end-to-end web applications using modern technologies like React, Node.js, and PostgreSQL. Skilled in both front-end and back-end development, with a strong focus on performance, scalability, and user experience. Proven ability to deliver high-quality solutions in fast-paced, agile environments.",
    "visitBtn": "Visit",
    "or": "or",
    "getCvBtn": "Get the CV"
  },
  "navbar": {
    "home": "Home",
    "experience": "Experience",
    "knowledge": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },
  "experience": {
    "bachelorBegin": {
      "title": "Full Stack Developer – TechNova Solutions",
      "description": "Leading the development of a cloud-based project management platform using React, Node.js, and AWS. Designed and implemented RESTful APIs and optimized front-end components for performance and responsiveness. Collaborated with UI/UX designers and DevOps engineers to streamline CI/CD pipelines and reduce deployment time by 40%.",
      "time": "2023-2024"
    },
    "androidDsGroup": {
      "title": "Software Engineer – ByteForge Labs",
      "description": "Built a scalable e-commerce web app using Next.js, Express.js, and MongoDB, supporting real-time inventory tracking and secure payments. Integrated third-party APIs for shipping and tax calculation, and implemented unit and integration tests to ensure code reliability. Improved page load speed by 30% through code splitting and lazy loading strategies.",
      "time": "2024-2025"
    },
    "flutterDsGroup": {
      "title": "Junior Full Stack Developer – CloudNest Technologies",
      "description": "Contributed to the development of an internal dashboard system for analytics and reporting using Angular, .NET Core, and SQL Server. Created reusable front-end components and implemented role-based access control for enterprise clients. Participated in daily scrums, code reviews, and deployed updates in an agile workflow.",
      "time": "2025-2026"
    }
  },
  "skills": {
    "java":"java:",
    "kotlin": "kotlin:",
    "flutter": "flutter:",
    "javascript": "javascript:",
    "typescript": "typescript:",
    "react": "react:",
    "nextJs": "next.js:",
    "tailwind": "tailwind:",
    "posgresql": "posgtresql:",
    "nodeJs": "node.js:",
    "firebase": "firebase:",
    "supabase": "supabase:",
    "mongodb": "mongodb:",
    "ffmpeg": "ffmpeg:",
    "italian": "italian:",
    "english": "english:",
    "german": "german:",
    "mobile": "mobile",
    "web": "web",
    "dbBackend": "db & backend",
    "mediaProc": "media proc.",
    "language": "languages"
  },
  "projects": {
    "afse": {
      "title": "Marvel Stickers Collection",
      "description": "Discover a web application built entirely with vanilla JavaScript, developed for a university exam. This app allows users to collect, buy, and trade Marvel stickers. The frontend is powered by a custom framework I created to ensure a smooth Single Page Application (SPA) experience, providing seamless navigation. Enjoy an intuitive interface for managing your collection and engaging in trades with others."
    },
    "portfolio": {
      "title":"Personal portfolio",
      "description":"Explore my portfolio built with Next.js and styled using Tailwind CSS and DaisyUI.\nI have focused on both server-side and client-side rendering optimizations to ensure fast load times and high performance. The interface is modern and consistent, designed to highlight my skills, projects, and professional experience.\nIt follows Google’s mobile-first indexing guidelines and accessibility best practices."
    },
    "public": "public",
    "private": "private"
  },
  "contact": {
    "formTitle": "get in touch",
    "nameForm": "Name",
    "emailForm": "Email",
    "messageForm": "Message",
    "submitBtn": "Submit",
    "okBtn":"Message sent",
    "errorBtn": "Something went wrong",
    "contactTitle": "contact info",
    "location": "Colombia, IT",
    "rights": "© Star. All rights reserved"
  },
  "meta": {
    "home": {
      "title": "Tvoosai – Mobile & Web Developer Freelance",
      "description": "Portfolio of Matteo, a mobile and web freelance developer skilled in Flutter, React, and modern backend technologies."
    },
    "experience": {
      "title": "Work Experience – Flutter, React, Backend | Tvoosai",
      "description": "Explore Matteo's work experience and certifications in mobile and web development."
    },
    "skills": {
      "title": "Technical Skills – Tech Stack | Tvoosai",
      "description": "Programming languages, tools, and technologies Matteo uses in his projects."
    },
    "projects": {
      "title": "Projects – Matteo’s Portfolio | Tvoosai",
      "description": "A selection of personal and commercial projects developed by Matteo."
    },
    "contact": {
      "title": "Contact Me – Freelance & Collaborations | Tvoosai",
      "description": "Get in touch with Matteo for collaborations, freelance opportunities, or tech networking."
    }
  }
}